zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_memslot.c
/*******************************************************************************
* Function Name: Cy_SMIF_MemGetSDLTap
****************************************************************************//**
*
* This function retrieves the Slave Delay Line (SDL) Tap in use.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The device for which SDL tap value has to be retrieved.
*
* \param posTap
* Returns positive delay tap value set.
*
* \param negTap
* Returns negative delay tap value set.
*
* \return A status of the command transmission.
*        - \ref CY_SMIF_SUCCESS
*        - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemGetSDLTap(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint8_t* posTap, uint8_t* negTap)
{
    cy_en_smif_status_t SMIF_Status = CY_SMIF_SUCCESS;
    uint32_t device_index = 0U;

    if ((posTap == NULL) || (negTap == NULL))
    {
        SMIF_Status = CY_SMIF_BAD_PARAM;
    }

    if (SMIF_Status == CY_SMIF_SUCCESS)
    {
        SMIF_Status = Cy_SMIF_ConvertSlaveSlotToIndex(memConfig->slaveSelect , &device_index);
    }

    if (SMIF_Status == CY_SMIF_SUCCESS)
    {
        *posTap = (uint8_t)_FLD2VAL(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_NEG_SDL_TAP_SEL, SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_index));
        *negTap = (uint8_t)_FLD2VAL(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_POS_SDL_TAP_SEL, SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_index));
    }

    return SMIF_Status;
}
/*******************************************************************************
* Function Name: Cy_SMIF_MemSetSDLTap
****************************************************************************//**
*
* This function sets the Slave Delay Line (SDL) tap ranging from 0 to 15.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The device for which SDL tap value has to be set.
*
* \param posTap
* Positive delay tap value to be set.
*
* \param negTap
* Negative delay tap value to be set.

* modify anything in this structure.
*
* \return A status of the command transmission.
*        - \ref CY_SMIF_SUCCESS
*        - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemSetSDLTap(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint8_t posTap, uint8_t negTap)
{
    cy_en_smif_status_t SMIF_Status = CY_SMIF_SUCCESS;
    uint32_t device_index = 0U;

    if ((posTap > (SMIF_DELAY_TAPS_NR - 1U)) || (negTap > (SMIF_DELAY_TAPS_NR - 1U)) || (memConfig == NULL))
    {
        return CY_SMIF_BAD_PARAM;
    }

    SMIF_Status = Cy_SMIF_ConvertSlaveSlotToIndex(memConfig->slaveSelect , &device_index);

    if (SMIF_Status != CY_SMIF_SUCCESS)
    {
        return SMIF_Status;
    }

    SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_index) &= ~SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_NEG_SDL_TAP_SEL_Msk;
    SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_index) &= ~SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_POS_SDL_TAP_SEL_Msk;

    SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_index) |= _VAL2FLD(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_NEG_SDL_TAP_SEL, posTap);
    SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_index) |= _VAL2FLD(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_POS_SDL_TAP_SEL, negTap);

    return SMIF_Status;
}
/*******************************************************************************
* Function Name: Cy_SMIF_MemCalibrateSDL
****************************************************************************//**
*
* This function takes an offset address as input to perform read/write test and
* assign best possible Slave Delay Line (SDL) tap. In case of flash memory, the
* sector where the address falls in would be erased to perform write operation
* of calibration pattern.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The device to which calibration of SDL tap
*
* \param calibrationDataOffsetAddress
* Offset address in the memory to which calibration pattern would be written and
* read back to identify the best possible SDL tap.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command transmission.
*        - \ref CY_SMIF_SUCCESS
*        - \ref CY_SMIF_EXCEED_TIMEOUT
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCalibrateSDL(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint32_t calibrationDataOffsetAddress, cy_stc_smif_context_t *context)
{
    uint8_t                  tapNum;
    cy_en_smif_status_t       SMIF_Status     = CY_SMIF_SUCCESS;
    uint16_t dataRead[CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH];
    uint16_t memoryCalibrationDataPattern[CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH];
    bool isMatch[SMIF_DELAY_TAPS_NR];

    for(uint16_t i = 0; i < CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH; i++)
    {
        memoryCalibrationDataPattern[i] = i;
    }

    for(uint16_t i = 0; i < SMIF_DELAY_TAPS_NR; i++)
    {
        isMatch[i] = false;
    }

    /* Hyper Bus Part */
    if (memConfig->hbdeviceCfg != NULL)
    {
        /* If it is Hyper Flash memory - Erase before writing */
        if(memConfig->hbdeviceCfg->hbDevType == CY_SMIF_HB_FLASH)
        {
            SMIF_Status = Cy_SMIF_HyperBus_EraseSector(base, memConfig, calibrationDataOffsetAddress, context);
        }

        if (SMIF_Status == CY_SMIF_SUCCESS)
        {
            SMIF_Status = Cy_SMIF_HyperBus_Write(base,
                                     memConfig,
                                     CY_SMIF_HB_COUTINUOUS_BURST,
                                     calibrationDataOffsetAddress, // address
                                     CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH,             // size in half word
                                     memoryCalibrationDataPattern,
                                     memConfig->hbdeviceCfg->hbDevType,
                                     memConfig->hbdeviceCfg->dummyCycles,
                                     true,                                // Blocking mode
                                     context
                                     );
        }
        else
        {
            return SMIF_Status;
        }

        for(tapNum = 0U; tapNum < SMIF_DELAY_TAPS_NR; tapNum++)
        {
            uint32_t timeout = ONE_MILLI_IN_MICRO;
            while(Cy_SMIF_BusyCheck(base) && (timeout > 0UL))
            {
                timeout--;
                Cy_SysLib_DelayUs(1U);
                /* Wait for the device to be ready */
            }
            if(timeout == 0U)
            {
                return CY_SMIF_EXCEED_TIMEOUT;
            }

            (void)Cy_SMIF_MemSetSDLTap(base, memConfig, tapNum, tapNum);

            (void)memset(dataRead, 0, CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH * 2U);
            SMIF_Status = Cy_SMIF_HyperBus_Read(base,
                                                  memConfig,
                                                  CY_SMIF_HB_COUTINUOUS_BURST,
                                                  calibrationDataOffsetAddress,                      // address
                                                  CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH,  // size in half word
                                                  dataRead,
                                                  memConfig->hbdeviceCfg->dummyCycles,
                                                  false,                                           // single initial latency
                                                  true,                                              // blocking mode
                                                  context
                                                 );
             if(SMIF_Status == CY_SMIF_SUCCESS)
             {
                 // Record whether the current tap read data matches the reference data
                 isMatch[tapNum] = (memcmp((uint8_t*)&dataRead, (uint8_t*)memoryCalibrationDataPattern, CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH) == 0) ? true : false;
             }
         }
    }
    else if (memConfig->deviceCfg != NULL)
    {
        /* Serial Flash Memory */

        /* Erase sector used for calibration */
        SMIF_Status = Cy_SMIF_MemEraseSector(base, (cy_stc_smif_mem_config_t* )memConfig, calibrationDataOffsetAddress,
                                        memConfig->deviceCfg->eraseSize, context);


        /* Write the calibration pattern */
        SMIF_Status = Cy_SMIF_MemWrite(base, memConfig, calibrationDataOffsetAddress,
                                  (uint8_t *)memoryCalibrationDataPattern,
                                  CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH * 2U, context);


        for(tapNum = 0U; tapNum < SMIF_DELAY_TAPS_NR; tapNum++)
        {
            uint32_t timeout = ONE_MILLI_IN_MICRO;
            while(Cy_SMIF_BusyCheck(base) && (timeout > 0UL))
            {
                timeout--;
                Cy_SysLib_DelayUs(1U);
                /* Wait for the device to be ready */
            }
            if(timeout == 0U)
            {
                return CY_SMIF_EXCEED_TIMEOUT;
            }

            (void)Cy_SMIF_MemSetSDLTap(base, memConfig, tapNum, tapNum);

            (void)memset(dataRead, 0, CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH * 2U);

            SMIF_Status = Cy_SMIF_MemRead(base, memConfig, calibrationDataOffsetAddress,
                                        (uint8_t *)dataRead, CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH * 2U, context);

