zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_memslot.c
             if (SMIF_Status == CY_SMIF_SUCCESS)
             {
                 // Record whether the current tap read data matches the reference data
                 isMatch[tapNum] = (memcmp((uint8_t*)&dataRead, (uint8_t*)memoryCalibrationDataPattern, CY_SMIF_MEM_CALIBRATION_DATA_PATTERN_LENGTH * 2U) == 0) ? true : false;
             }
         }
    }
    else
    {
        SMIF_Status = CY_SMIF_BAD_PARAM;
    }

    if (SMIF_Status == CY_SMIF_SUCCESS)
    {
        uint8_t bestTapNum             = CY_SMIF_TAP_NOT_FOUND; /* Unique number to identify failure case */
        uint8_t consecutiveMatchNum    = 0u;
        uint8_t maxConsecutiveMatchNum = 0u;

        // Determine the longest consecutive match
        for(tapNum = 0u; tapNum < SMIF_DELAY_TAPS_NR; tapNum++)
        {
            if(isMatch[tapNum] == true)
            {
                consecutiveMatchNum += 1u;
            }
            else
            {
                if(maxConsecutiveMatchNum < consecutiveMatchNum)
                {
                    // Sequence of matches ended and it is a new longest sequence -> update the best tap number and prepare vars for next run
                    maxConsecutiveMatchNum = consecutiveMatchNum;
                    bestTapNum               = tapNum - ((maxConsecutiveMatchNum + 1u) / 2u);
                    consecutiveMatchNum    = 0u;
                }
            }
        }

        // Special case: All taps had a match -> use the center tap of the total taps number
        if(maxConsecutiveMatchNum < consecutiveMatchNum)
        {
            bestTapNum = (uint8_t)(SMIF_DELAY_TAPS_NR / 2U);
        }

        // If a match has been found, apply the best tap
        if(bestTapNum != CY_SMIF_TAP_NOT_FOUND)
        {
           (void)Cy_SMIF_MemSetSDLTap(base, memConfig, bestTapNum, bestTapNum);
        }
        else
        {
            // No match has been found
            SMIF_Status = CY_SMIF_GENERAL_ERROR;
        }
    }

    return SMIF_Status;
}
#endif /*(CY_IP_MXSMIF_VERSION >= 5)*/

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSMIF */

/* [] END OF FILE */
